CHOSUNG_letters = { 'ㄱ': chr(10248),
                    'ㄲ': chr(10272) + chr(10248),
                    'ㄴ': chr(10249),
                    'ㄷ': chr(10250),
                    'ㄸ': chr(10272) + chr(10250),
                    'ㄹ': chr(10256),
                    'ㅁ': chr(10257),
                    'ㅂ': chr(10264),
                    'ㅃ': chr(10272) + chr(10264),
                    'ㅅ': chr(10272),
                    'ㅆ': chr(10272) + chr(10272),
                    'ㅇ': '',
                    'ㅈ': chr(10280),
                    'ㅉ': chr(10272) + chr(10280),
                    'ㅊ': chr(10288),
                    'ㅋ': chr(10251),
                    'ㅌ': chr(10259),
                    'ㅍ': chr(10265),
                    'ㅎ': chr(10266)
                    }

JUNGSUNG_letters = {'ㅏ': chr(10275),
                    'ㅐ': chr(10263),
                    'ㅑ': chr(10268),
                    'ㅒ': chr(10268) + chr(10263),
                    'ㅓ': chr(10240 + 8 + 4 + 2),
                    'ㅔ': chr(10240 + 16 + 8 + 4 + 1),
                    'ㅕ': chr(10240 + 32 + 16 + 1),
                    'ㅖ': chr(10240 + 8 + 4),
                    'ㅗ': chr(10240 + 32 + 4 + 1),
                    'ㅘ': chr(10240 + 32 + 4 + 2 + 1),
                    'ㅙ': chr(10240 + 32 + 4 + 2 + 1) + chr(10240 + 16 + 4 + 2 + 1),
                    'ㅚ': chr(10240 + 32 + 16 + 8 + 4 + 1),
                    'ㅛ': chr(10240 + 32 + 8 + 4),
                    'ㅜ': chr(10240 + 8 + 4 + 1),
                    'ㅝ': chr(10240 + 8 + 4 + 2 + 1),
                    'ㅞ': chr(10240 + 8 + 4 + 2 + 1) + chr(10240 + 16 + 4 + 2 + 1),
                    'ㅟ': chr(10240 + 8 + 4 + 1) + chr(10240 + 16 + 4 + 2 + 1),
                    'ㅠ': chr(10240 + 32 + 8 + 1),
                    'ㅡ': chr(10240 + 32 + 8 + 2),
                    'ㅢ': chr(10240 + 32 + 16 + 8 + 2),
                    'ㅣ': chr(10240 + 16 + 4 + 1)
                    }

JONGSUNG_letters = {'ㄱ': chr(10240 + 1),
                    'ㄴ': chr(10240 + 16 + 2),
                    'ㄷ': chr(10240 + 16 + 4),
                    'ㄹ': chr(10240 + 4),
                    'ㅁ': chr(10240 + 32 + 4),
                    'ㅂ': chr(10240 + 2 + 1),
                    'ㅅ': chr(10240 + 4),
                    'ㅇ': chr(10240 + 32 + 16 + 4 + 2),
                    'ㅈ': chr(10240 + 4 + 1),
                    'ㅊ': chr(10240 + 4 + 2),
                    'ㅋ': chr(10240 + 16 + 4 + 2),
                    'ㅌ': chr(10240 + 32 + 4 + 2),
                    'ㅍ': chr(10240 + 32 + 16 + 2),
                    'ㅎ': chr(10240 + 32 + 16 + 4)
                    }
JONGSUNG_letters['ㄲ'] = JONGSUNG_letters['ㄱ'] + JONGSUNG_letters['ㄱ']
JONGSUNG_letters['ㄳ'] = JONGSUNG_letters['ㄱ'] + JONGSUNG_letters['ㅅ']
JONGSUNG_letters['ㄵ'] = JONGSUNG_letters['ㄴ'] + JONGSUNG_letters['ㅈ']
JONGSUNG_letters['ㄶ'] = JONGSUNG_letters['ㄴ'] + JONGSUNG_letters['ㅎ']
JONGSUNG_letters['ㄺ'] = JONGSUNG_letters['ㄹ'] + JONGSUNG_letters['ㄱ']
JONGSUNG_letters['ㄻ'] = JONGSUNG_letters['ㄹ'] + JONGSUNG_letters['ㅁ']
JONGSUNG_letters['ㄼ'] = JONGSUNG_letters['ㄹ'] + JONGSUNG_letters['ㅂ']
JONGSUNG_letters['ㄽ'] = JONGSUNG_letters['ㄹ'] + JONGSUNG_letters['ㅅ']
JONGSUNG_letters['ㄾ'] = JONGSUNG_letters['ㄹ'] + JONGSUNG_letters['ㅌ']
JONGSUNG_letters['ㄿ'] = JONGSUNG_letters['ㄹ'] + JONGSUNG_letters['ㅍ']
JONGSUNG_letters['ㅀ'] = JONGSUNG_letters['ㄹ'] + JONGSUNG_letters['ㅎ']
JONGSUNG_letters['ㅄ'] = JONGSUNG_letters['ㅂ'] + JONGSUNG_letters['ㅅ']
JONGSUNG_letters['ㅆ'] = chr(10240 + 8 + 4)


contractions = {'가': chr(10240 + 32 + 8 + 2 + 1),
                '나': chr(10240 + 8 + 1),
                '다': chr(10240 + 8 + 2),
                '마': chr(10240 + 16 + 1),
                '바': chr(10240 + 16 + 8),
                '사': chr(10240 + 4 + 2 + 1),
                '자': chr(10240 + 32 + 8),
                '카': chr(10240 + 8 + 2 + 1),
                '타': chr(10240 + 16 + 2 + 1),
                '파': chr(10240 + 16 + 8 + 1),
                '하': chr(10240 + 16 + 8 + 2),
                '것': chr(10240 + 32 + 16 + 8),
                '억': chr(10240 + 32 + 16 + 8 + 1),
                '언': chr(10240 + 63 - 1),
                '얼': chr(10240 + 63 - 1 - 32),
                '연': chr(10240 + 32 + 1),
                '열': chr(10240 + 63 - 4 - 8),
                '영': chr(10240 + 63 - 4),
                '옥': chr(10240 + 63 - 16 - 2),
                '온': chr(10240 + 63 - 8),
                '옹': chr(10240 + 63),
                '운': chr(10240 + 63 - 32 - 4),
                '울': chr(10240 + 63 - 16),
                '은': chr(10240 + 63 - 2 - 8),
                '을': chr(10240 + 63 - 16 - 1),
                '인': chr(10240 + 31),
                '그래서': chr(10240 + 1) + chr(10240 + 2 + 4 + 8),
                '그러나': chr(10240 + 1) + chr(10240 + 1 + 8),
                '그러면': chr(10240 + 1) + chr(10240 + 2 + 16),
                '그러므로': chr(10240 + 1) + chr(10240 + 2 + 32),
                '그런데': chr(10240 + 1) + chr(10240 + 63 - 32 - 2),
                '그리고': chr(10240 + 1) + chr(10240 + 1 + 4 + 32),
                '그러하여': chr(10240 + 1) + chr(10240 + 1 + 16 + 32)
                }


punctuation = {',': chr(10240 + 16),
               ';': chr(10240 + 32 + 16) + chr(10240 + 4 + 2),
               ':': chr(10240 + 16) + chr(10240 + 2),
               '.': chr(10240 + 32 + 16 + 2),
               '!': chr(10240 + 16 + 4 + 2),
               '(': chr(10240 + 32 + 4 + 2) + chr(10240 + 4),
               ')': chr(10240 + 32) + chr(10240 + 32 + 16 + 4),
               '“': chr(10240 + 32 + 4 + 2),
               '”': chr(10240 + 32 + 16 + 4),
               '?': chr(10240 + 32 + 4 + 2),
               '/': chr(10240 + 32 + 16 + 8) + chr(10240 + 8 + 4),
               '…': chr(10240 + 32 + 16 + 2) + chr(10240 + 32 + 16 + 2),
               '­': chr(10240 + 32) + chr(10240 + 32 + 4 + 2),
               '-': chr(10240 + 32 + 4)
               }

numbers = {'1': chr(10240 + 8),
           '2': chr(10240 + 16 + 8),
           '3': chr(10240 + 8 + 1),
           '4': chr(10240 + 8 + 2 + 1),
           '5': chr(10240 + 8 + 2),
           '6': chr(10240 + 16 + 8 + 1),
           '7': chr(10240 + 16 + 8 + 2 + 1),
           '8': chr(10240 + 16 + 8 + 2),
           '9': chr(10240 + 16 + 1),
           '0': chr(10240 + 16 + 2 + 1)
           }

number_start = chr(10240 + 32 + 4 + 2 + 1)
